# 3. Калкулатор депозити
# Напишете програма, която изчислява каква сума ще получите в края на депозитния период при определен
# лихвен процент. Използвайте следната формула:
# сума = депозирана сума  + срок на депозита * ((депозирана сума * годишен лихвен процент ) / 12)
# Вход
# От конзолата се четат 3 реда:
#     1. Депозирана сума – реално число;
#     2. Срок на депозита(в месеци) – цяло число;
#     3. Годишен лихвен процент – реално число;

deposit_sum = float(input())
deposit_term = int(input())
interest_for_year = float(input())

total_sum = deposit_sum + deposit_term * ((deposit_sum * interest_for_year * 0.01) / 12)
print(total_sum)