# 6. Благотворителна кампания
# В сладкарница се провежда благотворителна кампания за събиране на средства, в която могат да се включат сладкари от
# цялата страна. Първоначално прочитаме от конзолата броя на дните, в които тече кампанията и броя на сладкарите, които ще се включат.
# След това на отделни редове получаваме количеството на тортите, гофретите и палачинките, които ще бъдат приготвени от един сладкар за един ден.
# Трябва да се има предвид следния ценоразпис:
#     • Торта - 45 лв.
#     • Гофрета - 5.80 лв.
#     • Палачинка – 3.20 лв.
# 1/8 от крайната сума ще бъде използвана за покриване на разходите за продуктите по време на кампанията. Да се напише програма, която
# изчислява сумата, която е събрана в края на кампанията.
# Вход
# От конзолата се четат 5 реда:
#     1. Броят на дните, в които тече кампанията – цяло число;
#     2. Броят на сладкарите – цяло число;
#     3. Броят на тортите – цяло число;
#     4. Броят на гофретите – цяло число;
#     5. Броят на палачинките – цяло число.

counter_days = int(input())
counter_bakers = int(input())
counter_cake = int(input())
counter_waffles = int(input())
counter_pancakes = int(input())

cake = counter_cake * 45
waffle = counter_waffles * 5.80
pancakes = counter_pancakes * 3.20

one_baker_per_day = cake + waffle + pancakes
all_bakers_per_day = one_baker_per_day * counter_bakers
sum_all_days = all_bakers_per_day * counter_days
expenses = sum_all_days / 8
profit = sum_all_days - expenses

print(profit)