#8. Зоомагазин
# Напишете програма, която пресмята нужните разходи за закупуването на храна за кучета и други животни. Една опаковка
# храна за кучета е на цена 2.50лв., а всяка останала, която не е за тях струва 4лв.
# Вход
# От конзолата се четат 2 реда:
#     1. Броят на кучетата - цяло число;
#     2. Броят на останалите животни  - цяло число.


dogs = float(input())
animals = float(input())

dogs_food = dogs * 2.50
animals_food = animals * 4
total_sum = dogs_food + animals_food
print(f'{total_sum} lv.')